/*
설명
	여러 개의 숫자 카드 중에서 가장 높은 숫자가 쓰인 카드 한장을 뽑는 게임.
	룰
		1. 숫자가 쓰인 카드들이 N행, M열 형태로 놓여 있음.
		2. 먼저 뽑고자 하는 카드ㅏ 포함되어 있는 행을 선택한다.
		3. 그다음 선택된 행에 포함된 카드들 중 가장 낮은 카드를 뽑아야 한다.
		4. 따라서 처음에 카드를 골라낼 행을 선택할때, 이후에 해당 행에서 가장 숫자가 낮은 카드를 뽑을 것을 고려해 최종적으로 가장 높은 숫자의 카드를 뽑을 수 있도록 전략을 세워야 한다.

입력 조건
	첫째 줄에 숫자 카드들이 놓인 행의 개수 N과 열의 개수 M이 공백을 기준으로 하여 각각 자연수로 주어진다. (1 <= N, M <= 100)
	둘째 줄부터 N개의 줄에 걸쳐 각 카드에 적힌 숫자가 주어진다. 각 숫자는 1이상 10000 이하의 자연수이다.

출력 조건
	첫째 줄에 게임의 룰에 맞게 선택한 카드에 적힌 숫자를 출력.
*/

/*
idea
	각 행에서 최솟값을 모두 구하고, 그 최솟값이 가장 큰 행을 고른다.
*/

#include <iostream>
#include <algorithm>

int	main(void)
{
	int	N, M;

	std::cin >> N >> M;
	int	arr[N][M];
	for (int i=0; i<N; i++)
	{
		for (int j=0; j<M; j++)
		{
			std::cin >> arr[i][j];
		}
	}

	for (int i=0; i<N; i++)
	{
		std::sort(arr[i], arr[i] + M);
	}

	int	max = arr[0][0];
	for (int i=0; i<N; i++)
	{
		if (arr[i][0] > max)
			max = arr[i][0];
	}
	std::cout << max << std::endl;
}